# Estrutura de Dados com Pandas

In [1]:
import pandas as pd

In [14]:
#cria Series = array unidimensional de valores
#toda Series possui um indice, que dá rotulo a cada elemento da lista
stock = { 'AMZN': pd.Series([100,200],
                           index=['indice 1','indice 2']),
         'GOO' : pd.Series([300,500],
                          index=['indice 1', 'indice 3']
                          )
      
}

In [19]:
#converte a Series criada acima em DataFrame
stockFrame = pd.DataFrame(stock)

In [20]:
stockFrame

           AMZN    GOO
indice 1  100.0  300.0
indice 2  200.0    NaN
indice 3    NaN  500.0

In [21]:
#exibe os indices
stockFrame.index

Index(['indice 1', 'indice 2', 'indice 3'], dtype='object')

In [22]:
#exibe os valores
stockFrame.values

array([[100., 300.],
       [200.,  nan],
       [ nan, 500.]])

# Operações com DataFrames 1/2

In [40]:
#cria um dicionario de dados aninhado

quadro_medalhas={
    'USA':{'Ouro': 100,'Prata':50,'Bronze':20},
    'BRA':{'Ouro': 150,'Prata':50,'Bronze':2},
    'CHN':{'Ouro': 70,'Prata':59,'Bronze':29},
    
    
}

In [41]:
quadro_medalhas

{'USA': {'Ouro': 100, 'Prata': 50, 'Bronze': 20},
 'BRA': {'Ouro': 150, 'Prata': 50, 'Bronze': 2},
 'CHN': {'Ouro': 70, 'Prata': 59, 'Bronze': 29}}

In [43]:
#converte para DataFrame
frame_medalhas = pd.DataFrame.from_dict(quadro_medalhas)

In [44]:
frame_medalhas

        USA  BRA  CHN
Bronze   20    2   29
Ouro    100  150   70
Prata    50   50   59

# Filtros

In [45]:
#exibe valores com base no nome da coluna
frame_medalhas.BRA

Bronze      2
Ouro      150
Prata      50
Name: BRA, dtype: int64

In [46]:
#exibe valores com base no nome da coluna
frame_medalhas['BRA']

Bronze      2
Ouro      150
Prata      50
Name: BRA, dtype: int64

In [47]:
#seleciona apenas os elementos com base no nome da coluna informado
frame_medalhas[['BRA','CHN']]

        BRA  CHN
Bronze    2   29
Ouro    150   70
Prata    50   59

# loc

In [52]:
#faz a busca com base no nome do indice
frame_medalhas.loc['Bronze']

USA    20
BRA     2
CHN    29
Name: Bronze, dtype: int64

# iloc

In [53]:
#faz a busca com base no valor do indice
frame_medalhas.iloc[1]

USA    100
BRA    150
CHN     70
Name: Ouro, dtype: int64

# Operações com DataFrame 2/2

# Slicing

In [55]:
frame_medalhas

        USA  BRA  CHN
Bronze   20    2   29
Ouro    100  150   70
Prata    50   50   59

In [56]:
#todas as linhas até o indice 2 exclusivo
frame_medalhas[:2]

        USA  BRA  CHN
Bronze   20    2   29
Ouro    100  150   70

In [58]:
#apenas a linha de indice 2
frame_medalhas[2:]

       USA  BRA  CHN
Prata   50   50   59

In [59]:
#todas as linhas e colunas saltando de 2 em 2
frame_medalhas[::2]

        USA  BRA  CHN
Bronze   20    2   29
Prata    50   50   59

In [81]:
# retorna todas os valores para a coluna especificada
frame_medalhas.loc[:,'BRA']

Bronze      2
Ouro      150
Prata      50
Name: BRA, dtype: int64

In [79]:
# retorna apenas o valor do indice Bronze para a coluna especificada
frame_medalhas.loc['Bronze','BRA']

2

In [82]:
#retorna True ou False no valor do indice com base em um valor especificado
frame_medalhas.loc['Ouro'] > 20

USA    True
BRA    True
CHN    True
Name: Ouro, dtype: bool

In [84]:
#retorna um dataframe com todos os valores
frame_medalhas.loc[:, frame_medalhas.loc['Ouro'] <= 100]

        USA  CHN
Bronze   20   29
Ouro    100   70
Prata    50   59

# Remove elementos

In [85]:
# remove elemento do dataframe
del frame_medalhas['CHN']

In [86]:
frame_medalhas

        USA  BRA
Bronze   20    2
Ouro    100  150
Prata    50   50

# Insere elementos

In [90]:
# insere elemento no dataframe
#Indice, nome da coluna, valores
frame_medalhas.insert(1,'AFR',(10,10,10))

In [91]:
frame_medalhas

        USA  AFR  BRA
Bronze   20   10    2
Ouro    100   10  150
Prata    50   10   50